JamesHarman0020/ECE4191-Team-13-PSoC/DesignAttempt01.cydsn/Generated_Source/PSoC4/StepperDriver.h
/*******************************************************************************
* File Name: StepperDriver.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_StepperDriver_H) /* CY_CONTROL_REG_StepperDriver_H */
#define CY_CONTROL_REG_StepperDriver_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} StepperDriver_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    StepperDriver_Write(uint8 control) ;
uint8   StepperDriver_Read(void) ;

void StepperDriver_SaveConfig(void) ;
void StepperDriver_RestoreConfig(void) ;
void StepperDriver_Sleep(void) ; 
void StepperDriver_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define StepperDriver_Control        (* (reg8 *) StepperDriver_Sync_ctrl_reg__CONTROL_REG )
#define StepperDriver_Control_PTR    (  (reg8 *) StepperDriver_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_StepperDriver_H */


/* [] END OF FILE */
